<template>
    <div>
        <v-row>
            <v-col cols="3">
                <div class="menu">
                    
                    <h4 class="text-decoration-underline">Мои жалобы</h4>
                    <br>
                    <h4>Мои предложения</h4>
                    <br>
                    <h4>Избранное</h4>
                </div>
            </v-col>
            <v-col cols="8" class="p-2 pr-7 report-col">
                <div class="divider"></div>
                <offer class="report-msg"
                            v-for="(report, index) in reports"
                            :key="index"
                            :data="reports[index]"/>
                <v-pagination
                    v-model="page"
                    :length="4"
                    :total-visible="4"
                ></v-pagination>
                <div class="divider"></div>
            </v-col>
        </v-row>
    </div>
</template>

<style scoped>
    .h4{
        font-family: Century Gothic;
        font-style: normal;
        font-weight: normal;
        font-size: 20px;
        line-height: 25px;
        padding-bottom: 40px;
    }
    .menu{
        padding-top: 80px;
        padding-left: 60px;
    }
    .report-msg{
        margin-bottom: 30px;
    }
    .divider{
        margin-top: 50px;
    }
</style>

<script>
import Offer from '../components/offer.vue'

export default {
    components: {
      Offer  
    },
    data: () => ({
        reports: [
                {
                    name: 'Пастухов Никита',
                    date: '01.11.2020',
                    text: 'В результате неисправности канализационной системы в посёлке Ромашки Приозерского района Ленинградской области происходит аварийный сброс неочищенных сточных вод на грунт в пределах сельского поселения через смотровой колодец (схема на местности прилагается).Собственником объектов КОС на территории МО Ромашкинское сельское является муниципальное образование Ромашкинское сельское поселение, на основании договора аренды № 6/14 от 04.07.2014 объектов водоотведения и канализования, администрацией МО Ромашкинское сельское поселение муниципальное имущество передано в аренду ООО «Уют-Сервис плюс», генеральный директор Рискин Владимир Ефимович.Неочищенные стоки накапливаясь в районе гаражей, поступают прямо в водосточные канавы. Стоки бегут под уклон, распространяя неприятные запахи. По системе каналов стоки попадают прямо в открытый водоем (река Вуокса-Вирта), откуда происходит водозабор для нужд п. Ромашки.',
                    likes: '127'
                },
                {
                    name: 'Алексей Иванов',
                    date: '12.10.2020',
                    text: 'Состояние железнодорожного переезда не соответствует никаким нормам!!! Ямы местное население вынуждено закладывать кирпичами. На мое телефонное обращение никакой реакции не последовало. Проблема никак не решается в течении нескольких лет. В летний период замедленный проезд данного переезда приводит к многочасовым пробкам!',
                    likes: '234'
                },
                {
                    name: 'Евгения Малышева',
                    date: '24.09.2020',
                    text: 'Здравствуйте!Уже не первый раз пишем жалобы в управляющую компанию \"Солнечный\" об отвратительной уборке. Невозможно выехать из двора, пройти с коляской, я уже молчу о пожилых людях, которым очень тяжело пройти. Перестали посыпать песком, хотя вокруг много домов строится и песка точно много. Около самого управления конечно же чисто, а чем хуже мы? Мы платим деньги и при этом постоянно пишем про ужасную уборку, ходим жалуемся. Очень просим помочь, чтобы уборка была надлежащей!',
                    likes: '366'
                }
            ],
            page: 1,
    })
}
</script>
