<template>
<div>
    <chart />

    <v-row justify="center">
        <v-col cols="4">
            <districts :states="dist" label="Укажите свой район"/>
            <districts :states="classes" label="Выберите класс происшествия"/>

            <day-statistics class="ml-2"/>
        </v-col>

        <v-col cols="8" class="p-3 pr-6">
            <Report v-for="i in reports" :key="i.text" :data="i"/>
        </v-col>
    </v-row>
</div>
</template>

<script>
import Vue from 'vue'
import DayStatistics from '../components/Statistics/DailyCalendar.vue'
import chart from '../components/Statistics/chart.vue'
import districts from '../components/autocomplete.vue'
import Report from '../components/report.vue'

export default {
    data() {
        return {
            dist: [
                'Выборгский район',
                'Московский район',
                'Петродворцовый район',
                'Курортный район',
                'Приморский район',
                'Пушкинский район',
                'Петроградский район',
                'Василеостровский район',
                'Красносельский район',
                'Невский район',
                'Центральный район',
                'Адмиралтейский район',
                'Фрунзенская район',
                'Калининский район',
                'Кировский район',
                'Кронштадтский район',
                'Колпинский район',
                'Красногвардейский район'
            ],

            classes: [
                'Дтп',
                'Пожар',
                'Свалка',
                'Загрязнение водоемов',
                'Дороги',
                'Благоустройство домов',
                'Благоустройство дворов',
                'Благоустройство придомовых территорий',
                'Нарушение водоснабжения',
                'Нарушение электроснабжения'
            ],

            reports: [
                {
                    name: 'Пастухов Никита',
                    date: '1.11.2020',
                    text: 'В результате неисправности канализационной системы в посёлке Ромашки Приозерского района Ленинградской области происходит аварийный сброс неочищенных сточных вод на грунт в пределах сельского поселения через смотровой колодец (схема на местности прилагается).Собственником объектов КОС на территории МО Ромашкинское сельское является муниципальное образование Ромашкинское сельское поселение, на основании договора аренды № 6/14 от 04.07.2014 объектов водоотведения и канализования, администрацией МО Ромашкинское сельское поселение муниципальное имущество передано в аренду ООО «Уют-Сервис плюс», генеральный директор Рискин Владимир Ефимович.Неочищенные стоки накапливаясь в районе гаражей, поступают прямо в водосточные канавы. Стоки бегут под уклон, распространяя неприятные запахи. По системе каналов стоки попадают прямо в открытый водоем (река Вуокса-Вирта), откуда происходит водозабор для нужд п. Ромашки.',
                    likes: '3'
                }
            ]
        }
    },

    components: {
        DayStatistics,
        districts,
        chart,
        Report
    },
}
</script>

<style scoped>
</style>